# 如何使用數字、數字的用法

from math import * #呼叫數學函式

# 數字的加減乘除可以直接寫出來，EX：print(8+5)、print(8-5)、print(8*5)、print(8/5)

# 整數的除法：兩個斜線 //
print(8//5) #結果應為 1

# 數字的運算也可以直接寫出來，然後依舊符合先乘除後加減
print(8+8*5) #應為 48
print((8+8)*5) #應為 80

# 取餘數：%
print(8%5) # 應為3

print("----------------我是分隔線1----------------")

number = 8
print(str(number)) # 將number 變為字串，原本為數字
print("會印出數字" + str(number)) #轉為字串後，就可使用字串相加

print("----------------我是分隔線2----------------")

# abs：取絕對值的意思
number = -8 
print(abs(number))

print("----------------我是分隔線3----------------")

# pow：次方
number = -8
print(pow(number,3)) #逗點前面為想要次方的數字，逗點後面為幾次方

print("----------------我是分隔線4----------------")
# max：取最大值
print(max(3,26,87,123))
# min：取最小值
print(min(3,26,87,123))

print("----------------我是分隔線5----------------")

# round：四捨五入
print(round(4.4)) #應為4
print(round(4.6)) #應為5

print("----------------我是分隔線6----------------")

# floor：無條件捨去
print(floor(4.9))
print(floor(6.1))

print("----------------我是分隔線7----------------")

# ceil：無條件進位
print(ceil(4.9))
print(ceil(6.1))

print("----------------我是分隔線8----------------")

# sqrt：開耕號
print(sqrt(16))

